app/controllers/groups_controller.rb

  def index
    @groups_approved = Group.all_approved.paginate(:page => params[:groups_approved_page]).per_page(20)
---
SELECT "groups".* FROM "groups"