app/controllers/relationships_controller.rb

  def index
    #@relationships_approved = Relationship.all_approved.paginate(:page => params[:relationships_approved_page]).per_page(20)
    @approved_relationships = Relationship.all_approved.paginate(:page => params[:approved_relationships_page]).per_page(20)
---
SELECT "relationships".* FROM "relationships"