app/controllers/users_controller.rb

  def index
    @active_users = User.active.order_by_sdfb_id.paginate(:page => params[:active_users_page]).per_page(30)
---
SELECT "users".* FROM "users"