app/controllers/user_rel_contribs_controller.rb

  def index
    @user_rel_contribs = UserRelContrib.all_approved.order_by_sdfb_id.paginate(:page => params[:user_rel_contribs_page]).per_page(30)
---
SELECT "user_rel_contribs".* FROM "user_rel_contribs"